hadess/rtl8723bs/hal/sdio_halinit.c
}

//
//	Description:
//		Read HW adapter information by E-Fuse or EEPROM according CR9346 reported.
//
//	Assumption:
//		PASSIVE_LEVEL (SDIO interface)
//
//
static s32 _ReadAdapterInfo8723BS(PADAPTER padapter)
{
    u8 val8;
	unsigned long start;

	RT_TRACE(_module_hci_hal_init_c_, _drv_info_, ("+_ReadAdapterInfo8723BS\n"));

	// before access eFuse, make sure card enable has been called
	if(padapter->hw_init_completed == false)
		_InitPowerOn_8723BS(padapter);


	val8 = rtw_read8(padapter, 0x4e);
	MSG_8192C("%s, 0x4e=0x%x\n", __func__, val8);
	val8 |= BIT(6);
	rtw_write8(padapter, 0x4e, val8);


	start = jiffies;

	_EfuseCellSel(padapter);
	_ReadRFType(padapter);
	_ReadPROMContent(padapter);
	_InitOtherVariable(padapter);

	if(padapter->hw_init_completed == false)	
	{
		rtw_write8(padapter, 0x67, 0x00); // for BT, Switch Ant control to BT
		CardDisableRTL8723BSdio(padapter);//for the power consumption issue,  wifi ko module is loaded during booting, but wifi GUI is off
	}	
	

	MSG_8192C("<==== _ReadAdapterInfo8723BS in %d ms\n", jiffies_to_msecs(jiffies - start));

	return _SUCCESS;
}

static void ReadAdapterInfo8723BS(PADAPTER padapter)
{
	// Read EEPROM size before call any EEPROM function
	padapter->EepromAddressSize = GetEEPROMSize8723B(padapter);

	_ReadAdapterInfo8723BS(padapter);
}

/*
 * If variable not handled here,
 * some variables will be processed in SetHwReg8723B()
 */
static void SetHwReg8723BS(PADAPTER padapter, u8 variable, u8 *val)
{
	PHAL_DATA_TYPE pHalData;
	u8 val8;

#if defined(CONFIG_WOWLAN) || defined(CONFIG_AP_MODE)
	struct wowlan_ioctl_param *poidparam;
	struct recv_buf *precvbuf;
	struct pwrctrl_priv *pwrctl = adapter_to_pwrctl(padapter);
	struct security_priv *psecuritypriv = &padapter->securitypriv;
	struct mlme_priv	*pmlmepriv = &padapter->mlmepriv;
	struct sta_info *psta = NULL;
	struct dvobj_priv *psdpriv = padapter->dvobj;
	struct debug_priv *pdbgpriv = &psdpriv->drv_dbg;
	int res, i;
	u32 tmp=0,tmp1=0, himr=0;
	u64 iv_low = 0, iv_high = 0;
	u16 len = 0;
	u8 mstatus = (*(u8 *)val);
	u8 trycnt = 100;
	u8 data[4];
#endif

_func_enter_;

	pHalData = GET_HAL_DATA(padapter);

	switch (variable)
	{
		case HW_VAR_SET_RPWM:
			// rpwm value only use BIT0(clock bit) ,BIT6(Ack bit), and BIT7(Toggle bit)
			// BIT0 value - 1: 32k, 0:40MHz.
			// BIT6 value - 1: report cpwm value after success set, 0:do not report.
			// BIT7 value - Toggle bit change.
			{
				val8 = *val;
				val8 &= 0xC1;
				rtw_write8(padapter, SDIO_LOCAL_BASE|SDIO_REG_HRPWM1, val8);
			}
			break;
		case HW_VAR_SET_REQ_FW_PS:
			//1. driver write 0x8f[4]=1  //request fw ps state (only can write bit4)
			{
				u8 req_fw_ps=0;
				req_fw_ps = rtw_read8(padapter, 0x8f);
				req_fw_ps |= 0x10;
				rtw_write8(padapter, 0x8f, req_fw_ps);
			}
			break;
		case HW_VAR_RXDMA_AGG_PG_TH:
			val8 = *val;
			break;

#ifdef CONFIG_WOWLAN
		case HW_VAR_WOWLAN:
		{
			poidparam = (struct wowlan_ioctl_param *)val;
			switch (poidparam->subcode){
				case WOWLAN_ENABLE:
					DBG_871X_LEVEL(_drv_always_, "WOWLAN_ENABLE\n");

					#ifndef DYNAMIC_CAMID_ALLOC
					val8 = (psecuritypriv->dot11AuthAlgrthm == dot11AuthAlgrthm_8021X)? 0xcc: 0xcf;
					rtw_write8(padapter, REG_SECCFG, val8);
					DBG_871X_LEVEL(_drv_always_, "REG_SECCFG: %02x\n", rtw_read8(padapter, REG_SECCFG));
					#endif

					//backup data rate to register 0x8b for wowlan FW
					rtw_write8(padapter, 0x8d, 1);
					rtw_write8(padapter, 0x8c, 0);
					rtw_write8(padapter, 0x8f, 0x40);
					rtw_write8(padapter, 0x8b,
					rtw_read8(padapter, 0x2f0));

					// 1. Download WOWLAN FW
					DBG_871X_LEVEL(_drv_always_, "Re-download WoWlan FW!\n");
					SetFwRelatedForWoWLAN8723b(padapter, true);

					// 2. RX DMA stop
					DBG_871X_LEVEL(_drv_always_, "Pause DMA\n");
					rtw_write32(padapter,REG_RXPKT_NUM,(rtw_read32(padapter,REG_RXPKT_NUM)|RW_RELEASE_EN));
					do{
						if ((rtw_read32(padapter, REG_RXPKT_NUM)&RXDMA_IDLE)) {
							DBG_871X_LEVEL(_drv_always_, "RX_DMA_IDLE is true\n");
							break;
						} else {
							// If RX_DMA is not idle, receive one pkt from DMA
							res = sdio_local_read(padapter, SDIO_REG_RX0_REQ_LEN, 4, (u8*)&tmp);
							len = le16_to_cpu(tmp);
							DBG_871X_LEVEL(_drv_always_, "RX len:%d\n", len);
							if (len > 0)
									res = RecvOnePkt(padapter, len);
							else
									DBG_871X_LEVEL(_drv_always_, "read length fail %d\n", len);

							DBG_871X_LEVEL(_drv_always_, "RecvOnePkt Result: %d\n", res);
                                                }
					}while(trycnt--);
					if(trycnt ==0)
						DBG_871X_LEVEL(_drv_always_, "Stop RX DMA failed...... \n");

					// 3. Clear IMR and ISR
					DBG_871X_LEVEL(_drv_always_, "Clear IMR and ISR\n");
					tmp = 0;
					sdio_local_write(padapter, SDIO_REG_HIMR_ON, 4, (u8*)&tmp);
					sdio_local_write(padapter, SDIO_REG_HIMR, 4, (u8*)&tmp);
					sdio_local_read(padapter, SDIO_REG_HISR, 4, (u8*)&tmp);
					sdio_local_write(padapter, SDIO_REG_HISR, 4, (u8*)&tmp);

					// 4. Enable CPWM2 only
					DBG_871X_LEVEL(_drv_always_, "Enable only CPWM2\n");
					sdio_local_read(padapter, SDIO_REG_HIMR, 4, (u8*)&tmp);
					DBG_871X("DisableInterruptButCpwm28723BSdio(): Read SDIO_REG_HIMR: 0x%08x\n", tmp);

					himr = cpu_to_le32(SDIO_HIMR_DISABLED)|SDIO_HIMR_CPWM2_MSK;
					sdio_local_write(padapter, SDIO_REG_HIMR, 4, (u8*)&himr);
			
					sdio_local_read(padapter, SDIO_REG_HIMR, 4, (u8*)&tmp);
					DBG_871X("DisableInterruptButCpwm28723BSdio(): Read again SDIO_REG_HIMR: 0x%08x\n", tmp);
					
					// 5. Set Enable WOWLAN H2C command.
					DBG_871X_LEVEL(_drv_always_, "Set Enable WOWLan cmd\n");
					rtl8723b_set_wowlan_cmd(padapter, 1);

					// 6. Check EnableWoWlan CMD is ready
					if(!pwrctl->wowlan_pno_enable) {
						DBG_871X_LEVEL(_drv_always_, "Check EnableWoWlan CMD is ready\n");
						mstatus = rtw_read8(padapter, REG_WOW_CTRL);
						trycnt = 10;
						while(!(mstatus&BIT1) && trycnt>1) {
							mstatus = rtw_read8(padapter, REG_WOW_CTRL);
							DBG_871X("Loop index: %d :0x%02x\n", trycnt, mstatus);
							trycnt --;
							msleep(2);
						}
					} 
					break;
					
				case WOWLAN_DISABLE:
					DBG_871X_LEVEL(_drv_always_, "WOWLAN_DISABLE\n");

					psta = rtw_get_stainfo(&padapter->stapriv, get_bssid(pmlmepriv));
					if (psta != NULL)
						rtl8723b_set_FwMediaStatusRpt_cmd(padapter, RT_MEDIA_DISCONNECT, psta->mac_id);	
					else
						DBG_871X("psta is null\n");

					#ifndef DYNAMIC_CAMID_ALLOC
					rtw_write8(padapter, REG_SECCFG, 0x0c|BIT(5));// enable tx enc and rx dec engine, and no key search for MC/BC
					DBG_871X_LEVEL(_drv_always_, "REG_SECCFG: %02x\n", rtw_read8(padapter, REG_SECCFG));
					#endif
					
					// 1. Read wakeup reason
					pwrctl->wowlan_wake_reason = rtw_read8(padapter, REG_WOWLAN_WAKE_REASON);
					DBG_871X_LEVEL(_drv_always_, "wakeup_reason: 0x%02x, mac_630=0x%08x, mac_634=0x%08x, mac_1c0=0x%08x, mac_1c4=0x%08x"
					", mac_494=0x%08x, , mac_498=0x%08x, mac_49c=0x%08x, mac_608=0x%08x, mac_4a0=0x%08x, mac_4a4=0x%08x\n"
					", mac_1cc=0x%08x, mac_2f0=0x%08x, mac_2f4=0x%08x, mac_2f8=0x%08x, mac_2fc=0x%08x, mac_8c=0x%08x"
					, pwrctl->wowlan_wake_reason, rtw_read32(padapter, REG_WOWLAN_GTK_DBG1), rtw_read32(padapter, REG_WOWLAN_GTK_DBG2)
					, rtw_read32(padapter, 0x1c0), rtw_read32(padapter, 0x1c4)
					, rtw_read32(padapter, 0x494), rtw_read32(padapter, 0x498), rtw_read32(padapter, 0x49c), rtw_read32(padapter, 0x608)
					, rtw_read32(padapter, 0x4a0), rtw_read32(padapter, 0x4a4)
					, rtw_read32(padapter, 0x1cc), rtw_read32(padapter, 0x2f0), rtw_read32(padapter, 0x2f4), rtw_read32(padapter, 0x2f8)
					, rtw_read32(padapter, 0x2fc), rtw_read32(padapter, 0x8c));
#ifdef CONFIG_PNO_SET_DEBUG
					DBG_871X("0x1b9: 0x%02x, 0x632: 0x%02x\n",rtw_read8(padapter, 0x1b9), rtw_read8(padapter, 0x632));
					DBG_871X("0x4fc: 0x%02x, 0x4fd: 0x%02x\n",rtw_read8(padapter, 0x4fc), rtw_read8(padapter, 0x4fd));
					DBG_871X("TXDMA STATUS: 0x%08x\n",rtw_read32(padapter, REG_TXDMA_STATUS));
#endif

					{
						// 2.  Set Disable WOWLAN H2C command.
						DBG_871X_LEVEL(_drv_always_, "Set Disable WOWLan cmd\n");
						rtl8723b_set_wowlan_cmd(padapter, 0);
						
						// 3. Check Disable WoWlan CMD ready.
						DBG_871X_LEVEL(_drv_always_, "Check DisableWoWlan CMD is ready\n");
						mstatus = rtw_read8(padapter, REG_WOW_CTRL);
						trycnt = 50;
						while(mstatus&BIT1 && trycnt>1) {
							mstatus = rtw_read8(padapter, REG_WOW_CTRL);
							DBG_871X_LEVEL(_drv_always_, "Loop index: %d :0x%02x\n", trycnt, mstatus);
							trycnt --;
							msleep(10);
						}
		
